tap "nikitabobko/tap" # Aerospace
tap "jorgerojas26/lazysql" 

# CLI Tools
brew "git"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "htop"
brew "jq"
brew "yq"
# ACME client (Let's Encrypt / ZeroSSL etc.)
brew "acme.sh"
# brew "gh"
brew "tmux"
brew "stow"
brew "neovim"
# brew "kubectl"

# Languages n stuff
brew "python"
brew "uv"
brew "node"
brew "nvm"

# GNU Utilities
brew "coreutils"
brew "gnu-sed"
brew "findutils"
brew "gawk"

# GUI Applications
cask "tabby"
# cask "visual-studio-code"
cask "raycast"
# cask "docker"
cask "aerospace"
cask "caffeine"
cask "shottr"
cask "datagrip"
cask "postman"
cask "fork"
cask "dotnet-sdk"
cask "another-redis-desktop-manager"

# Fonts
cask "font-jetbrains-mono-nerd-font"

